%模数
mn=[4 4 6 6];
%齿数
z=[17 93 18 62];
%斜角
beita=[0.1396 0.1396 0.1396 0.1396];
%齿轮直径68.6680  375.6545 109.0610  375.6545
D=z.*mn./cos(beita);
%中心距222.1612 242.3577
af=(D(1)+D(2))/2;
as=(D(3)+D(4))/2;
%箱体壁厚取10 8.5 P80
delt=3;
deltam=0.025*as+delt;
delta1m=0.85*deltam;
delta=10;
delta1=8.5;
%箱座箱盖箱座底凸缘厚度15 11.5502 25
b=1.5*delta;
b1=1.5*delta1;
b2=2.5*delta;
%地脚螺栓直径及数目20 4
dfm=0.047*as+8;
n=4;
df=20;
%轴承旁连接螺栓直径15
d1=0.75*df;
%箱盖箱座连接螺栓直径12 螺栓间距150-200
d2=0.6*df;
%轴承端盖螺钉直径
d3=[8 10 10];
%检查孔盖螺钉直径
d4=8;
%df d1 d2至箱外壁距离26 22 18 ; df d1 d2至凸缘边缘距离24 20 16???
c1=[26 22 18];
c2=[24 20 16];
%轴承外径
DD=[52 72 85];
%轴承座外径 92 122 135
D2=DD+5*d3;
%轴承旁联接螺栓距离
S=D2;
%轴承旁凸台半径
R1=c2(2);
%箱外壁至轴承座端面距离
L1=c1+c2+6;
%箱盖箱座肋厚
m1m=0.85*delta1;
mm=0.85*delta;
m1=8;
m=8.5;
%大齿轮顶圆与箱内壁间距离
delt1=1.2*delta;
%齿轮端面与箱内壁距离
delt2=delta;
%P80
