%% 电机的选用
%无需大范围平稳调速（直流），不经常启动和反转（YZ\YZR型三相异步电动机），使用Y系列一般用途的全封闭自扇冷鼠笼型三相交流异步电动机
%% 输送带选择I-05
Fw=2400;%Fw-输送带工作拉力
vw=1.2;%vw-输送带速度
Dw=300;%Dw-卷筒直径
%p4
etaw=0.94;
Pw=Fw*vw/etaw/1000;
sprintf('工作装置所需功率%.2dkW',Pw)

%% 传动方式选用b
etag=0.97;%齿轮效率
etar=0.995;%滚动轴承效率
etac1=0.99;
etac2=0.98;
%弹性柱塞联轴器LX1弹性柱销联轴器LX3效率p18
eta=etag^2*etar^3*etac1*etac2;%三对轴承 两个齿轮 两个联轴器
P0=Pw/eta;
sprintf('电动机输出功率%.2dkW',P0)
%3.41kW
%由于载荷平稳，电动机额定功率Pm只需略大于P0（一般3.41到3.41*1.3=4.4330）
%% 确定电动机转速
nw=6*1e4*vw/pi/Dw;%工作轴转速
imin=8;imax=40;%p13为平稳高低级都采用斜齿轮
nmin=nw*imin;nmax=nw*imax;
sprintf('总传动范围在%.2d-%.2d之间',nmin,nmax)
%总传动范围在611-3060之间,舍去边值，结合之前计算的功率，P328满足要求的如下：
%型号      额定功率 额定转速 额定转矩 最大转矩 质量
%Y132M1-6  4.0      960      2.0      2.2      73
%Y112M-4   4.0      1440     2.2      2.3      47
%
sprintf('暂选用Y112M-4型电机，额定功率4.0，额定转速1440')

%% 计算各级总传动比
%机座号80直径19j6
nm=1440;%电机转速
i=nm/nw;%总传动比
%电动机向低速的工作轴各级传动比依次增大较为有利p19，对于两级展开式圆柱齿轮减速器，If=1.3-1.6Is
Ismin=sqrt(i/1.6);Ifmax=Ismin*1.6;
Ismax=sqrt(i/1.3);Ifmin=Ismax*1.3;
sprintf('极限传动比为%0.2d(%0.2d)-%0.2d(%0.2d)',Ismin,Ifmax,Ismax,Ifmin)
%极限传动比为3.43(5.49)-3.81(4.95)
%% 根据part two选定If
If=93/17;
Is=62/18;
n1=nm;
n2=nm/Is;
n3=n2/If;%各轴转速382r/min 76.4r/min
P1=P0*etac1;
P2=P1*etag*etar;
P3=P2*etar*etag;
P4=P3*etar*etac2;%P4=Pw
T1=9550*P1/n1;
T2=9550*P2/n2;
T3=9550*P3/n3;
Tw=9550*P3/nw;
T0=9550*P0/nm;

%转矩
%             | 电动机轴 | I轴    | II轴    | III轴   | 工作轴    |
%转速n(r/min) | 1440     | 1440   | 418.0645| 76.4204 | 76.4204   |
%功率P(kW)    | 3.4071   | 3.3731 | 3.2555  | 3.1421  | 3.0638    |
%转矩T(N*m)   | 22.5960  | 22.3700| 74.3671 | 392.6536| 392.7873  |
%传动比i      |            5.4706      |      3.4444              |
%效率eta      |     0.9900   | 0.9651  | 0.9651  |    0.9751      |



