clc
clear
mn=[4 4 6 6];
z=[17 93 18 62];
alpha=pi/9;
beita=[0.1396 0.1396 0.1396 0.1396];
%齿轮直径68.6680  375.6545  109.0610  375.6545
D=z.*mn./cos(beita);
%齿轮宽
b(1)=75;
b(2)=D(1);
b(3)=115;
b(4)=D(3);
%中心距
a1=(D(1)+D(2))/2;%222
a2=(D(3)+D(4))/2;%242
%最小侧隙查表8-96
j(1)=0.20;
j(2)=0.23;
%齿厚上偏差表8-96
E=-j/2/cos(alpha);
%查表8-84径向跳动公差
Fr=[0.044 0.075 0.044 0.075];
%8-27公差值
IT9=[0.074 0.140 0.087 0.140];
br=IT9*1.261;
Tsn=2*tan(alpha)*(Fr.^2+br.^2).^0.5;
%轴后下偏差
Esni(1)=E(1)-Tsn(1);
Esni(2)=E(1)-Tsn(2);
Esni(3)=E(2)-Tsn(3);
Esni(4)=E(2)-Tsn(4);
%公法线长度偏差
%公法线上偏差
Ebns(1)=E(1)*cos(alpha);
Ebns(2)=E(1)*cos(alpha);
Ebns(3)=E(2)*cos(alpha);
Ebns(4)=E(2)*cos(alpha);
%下偏差
Ebni=Esni*cos(alpha);
%8-98公法线长度
Kb=1.028;%当量齿数系数 差值0.008
ze=Kb*z;%[17.4760000000000,95.6040000000000,18.5040000000000,63.7360000000000]
dWek=[0.0067 0.0084 0.0070 0.0103];
Wek=[4.6663 32.3279 7.6324 23.0233];
Wnk=(Wek+dWek).*mn;
for i= 1:4
    sprintf('第%d个齿公法线长度，%d %d %d',i,Wnk(i),Ebns(i),Ebni(i))
end

%单个齿距偏差
fpt=[18.0 22.0 18.0 22.0]*0.001;
%齿轮累计总偏差
Fp=[55 94 55 94]*0.001;
%齿廓总偏差
Fa=[27 34 27 34]*0.001;
%螺旋线总偏差
Fb=[28 28 33 33]*0.001;
%径向跳动公差
Fr=[44 75 44 75]*0.001;
%中心距极限偏差0.040
fa=[fpt(1)+fpt(2) fpt(3)+fpt(4)];
