clc
clear
sprintf('请输入之前算得的转矩功率转速等数据')
%共三根轴，按转矩确定材料，功率较小，选用45号刚足够：
T=[22.3700 74.3671 74.3671 392.6536];
P=[3.3731  3.2555   3.1421];
n=[1440    418.0645 76.4204];
mn=[4 4 6 6];
z=[17 93 18 62];
beita=[0.1396 0.1396 0.1396 0.1396];
C=110;
%得到的轴选用轴I直径估计：
dmin=C*(P./n).^(1/3);
%分别计算tao并核对
tao=9.55*10^6*P./n/0.2./dmin.^3;
%均为35.8753 在30-40之间 符合40号钢要求。
%有键槽，增加%5并圆整
sprintf('直径下限：\n%d \n%d \n%d',1.05*dmin(1),1.05*dmin(2),1.05*dmin(3))
%15.33925 22.89322 39.86443
d=[20 30 40];
%联轴器 轴I选用LX2型直径20 轴III选用LT7直径40
%齿轮分度圆直径
D=z.*mn./cos(beita);
%齿轮齿宽
%轴承之间距离220 轴II轴肩10 两个小齿轮厚度
%齿轮和两边轴承分别相距12 11.1660
sprintf('请根据小齿轮分度圆%d，%d指定齿厚',D(1),D(3))
b(1)=75;
b(2)=D(1);
b(3)=115;
b(4)=D(3);
sprintf('请根据齿厚估算齿轮箱总宽broadth，中央轴肩midarm，与箱后壁距离topedge')
broadth=240;
midarm=10;
topedge=22;
downedge=broadth-midarm-topedge-b(3)-(b(1)+b(2))/2;
A1=downedge+b(1)/2;
B1=broadth-A1;
A2=A1;
C2=topedge+b(3)/2;
B2=broadth-A2-C2;
C3=C2;
B3=broadth-C3;

Ft(1)=2*T(1)/D(1);
Ft(2)=2*T(2)/D(2);
Ft(3)=2*T(3)/D(3);
Ft(4)=2*T(4)/D(4);
Fr=2*T./D*tan(pi/9)./cos(beita);
Fa(1)=2*T(1)/D(1)*tan(beita(1));
Fa(2)=2*T(2)/D(2)*tan(beita(2));
Fa(3)=2*T(3)/D(3)*tan(beita(3));
Fa(4)=2*T(4)/D(4)*tan(beita(4));
%P300
R1H(1)=(Fa(1)*D(1)/2+Fr(1)*B1)/broadth;
R2H(1)=Fr(1)-R1H(1);
R1V(1)=Ft(1)*B1/broadth;
R2V(1)=-R1V(1)+Ft(1);
M(1)=sqrt((R1H(1)*A1)^2+(R1V(1)*A1)^2);
Mbe(1)=sqrt(M(1)^2+0.58^2*T(1)^2);
%Fa指向R1
A(1)=Fa(1);

R1H(2)=(Fa(2)*D(2)/2+Fa(3)*D(3)/2+Fr(3)*C2-Fr(2)*(B2+C2))/broadth;
R2H(2)=R1H(2)+Fr(2)-Fr(3);
R1V(2)=(Ft(2)*(B2+C2)+Ft(3)*C2)/broadth;
R2V(2)=-R1V(1)+Ft(2)+Ft(3);
M(2)=max(sqrt((R1H(2)*A2)^2+(R1V(2)*A2)^2),sqrt((R2H(2)*C2)^2+(R2V(2)*C2)^2));
Mbe(2)=sqrt(M(2)^2+0.58^2*T(2)^2);
%Fa指向R1,即Fa(3)-Fa(2)
A(2)=Fa(3)-Fa(2);

R1H(3)=(-Fa(4)*D(4)/2+Fr(4)*C3)/broadth;
R2H(3)=Fr(4)-R1H(3);
R1V(3)=Ft(4)*C3/broadth;
R2V(3)=-R1V(3)+Ft(4);
M(3)=sqrt((R1H(3)*B3)^2+(R1V(3)*B3)^2);
Mbe(3)=sqrt(M(3)^2+0.58^2*T(4)^2);
%Fa指向R2
A(3)=Fa(4);

%计算最小轴径
drecheck=(Mbe/0.1/55).^(1/3)*10;
%18.2888   27.2180   35.8514 合格

%疲劳强度
sigmaa=32*1000*M/pi./d.^3;
sigmam=0;
taua(1)=T(1)*1000*8/pi/d(1)^3;
taua(2)=T(2)*1000*8/pi/d(2)^3;
taua(3)=T(4)*1000*8/pi/d(3)^3;
taum=taua;
Sa=1*275*0.81*0.95/1.76./sigmaa;
Sr=1*140./(1.54/0.76/0.95*taua+0.1*taum);
S=Sa.*Sr./sqrt(Sa.^2+Sr.^2);
%2.8753    2.9453    3.4552  成功

%选用圆锥滚子轴承 
R1=(R1V.^2+R1H.^2).^0.5;
R2=(R2V.^2+R2H.^2).^0.5;
Y=1.6;
S1=R1/(2*Y);
S2=R2/(2*Y);
for i=1:3
    sprintf('第%d根轴 S1=%d A=%d S2=%d',i,S1(i),A(i),S2(i))
end

%0.1705299  0.09155055   0.04663381下端压紧
S2(1)=S1(1)-A(1);
%0.2351002  0.1359947    0.3971042上端压紧
S1(2)=S2(2)-A(2);
%0.2063932  0.2937450    0.5085201下端压紧
S2(3)=S2(3)+A(3);

sprintf('挑选轴承')
%轴承30205 30207 30209
C=0.95*[32.2 54.2 67.9];
C0=[37.0 63.5 83.8];
e1=A./R1;
e2=A./R2;
ee=[0.37 0.37 0.40];
Yee=[1.6 1.6 1.5];
for i =1:3
    if e1(i)<=ee(i)
        Xe=1;
        Ye=0;
    else
        Xe=0.40;
        Ye=Yee(i);
    end
    P1=(Xe*R1(i)+Ye*A(i))*1.1;
    L10h(2*i-1)=10^6/60/n(i)*(C(i)/P1)^(10/3);
    if e2(i)<=ee(i)
        Xe=1;
        Ye=0;
    else
        Xe=0.40;
        Ye=Yee(i);
    end
    P2=(Xe*R2(i)+Ye*A(i))*1.1;
    L10h(2*i)=10^6/60/n(i)*(C(i)/P2)^(10/3);
end
year=min(L10h)/4800;
%1311年

