%齿轮设计
clc
clear
i=18.85;
%x0=[3 5 14 18 6.4 0.15 0.18]; 
x0=[3 5 18 16 5.2 0.15 0.18]; 
lb=[]; 
ub=[];  
options=optimset('LargeScale','off','display','iter','tolx',1e-6);  
[x,a,exitflag,output]=fmincon('goalfun',x0,[],[],[],[],[2 3.5 14 16 sqrt(i*1.3) 0.1396 0.1396],[5 6 22 22 sqrt(i*1.6) 0.2618 0.2618],'confun',options); 
x 
a
%输出为：x =[3.2518    5.9996   20.0586   17.6018    5.4914    0.2038    0.1436]
%中心距a =452.6659
%考虑到取整，
x1=[3 6 20 17 5.45 0.2038 0.1436];
abs(x1(1)*x1(3)*x1(5)/cos(x1(6))-x1(2)*x1(4)*i/x1(5)/cos(x1(7)))
%取整后两极大齿轮大小相差22.5475，很难调整

%% 这里使用遗传算法，对非线性优化算法的解无法限制整数类型做出了改进
%由于遗传算法的解具有随机性，每次的运行结果都不相同 以下为几组运行得到的结果：

[x,a,exitflag,output]=ga(@goalfun,7,[],[],[],[],[2 3.5 14 16 sqrt(i*1.3) 0.1396 0.1396],[4 5 22 22 sqrt(i*1.6) 0.2618 0.2618],@confun,[1 2 3 4],options); 
x
a
x2=[5.0000    5.0000   14.0000   22.0000    5.4425    0.1396    0.1396];
abs(x2(1)*x2(3)*x2(5)/cos(x2(6))-x2(2)*x2(4)*i/x2(5)/cos(x2(7)))
%差为0.0081,中心距475.6058
%大齿轮齿数取整 z2=76 z4=76
x3=[4.0000    6.0000   17.0000   18.0000    5.4707    0.1396    0.1396];
abs(x3(1)*x3(3)*x3(5)/cos(x3(6))-x3(2)*x3(4)*i/x3(5)/cos(x3(7)))
%差为0.1215,中心距464.5874
%大齿轮齿数取整 z2=93 z4=62

